<UNK>	1
=	2
if	3
i	4
to	5
<<	6
{	7
n	8
for	9
int	10
long	11
>>	12
+	13
-	14
0	15
is	16
and	17
print	18
a	19
else	20
cout	21
read	22
0;	23
1	24
cin	25
of	26
<	27
==	28
endl;	29
n;	30
integer	31
(int	32
set	33
ans	34
*	35
j	36
with	37
b	38
i++)	39
x	40
1;	41
create	42
}	43
/	44
k	45
s	46
n,	47
m	48
2	49
c	50
<=	51
while	52
%	53
exclusive	54
increment	55
the	56
than	57
equal	58
declare	59
string	60
sum	61
by	62
>	63
return	64
integers	65
0)	66
0,	67
1)	68
a,	69
let	70
y	71
+=	72
from	73
t	74
size	75
&&	76
array	77
new	78
be	79
newline	80
(i	81
value	82
!=	83
d	84
greater	85
a[i]	86
1]	87
l	88
>=	89
r	90
m;	91
or	92
less	93
p	94
cnt	95
inclusive	96
"	97
loop	98
b,	99
(n	100
s;	101
not	102
j++)	103
k;	104
2;	105
line	106
res	107
flag	108
then	109
1,	110
const	111
i,	112
x,	113
b;	114
3	115
function	116
length	117
2)	118
count	119
10	120
a;	121
in	122
input	123
(a	124
char	125
true	126
m,	127
break;	128
s[i]	129
"NO"	130
x;	131
k,	132
v	133
decrement	134
"YES"	135
exclusive,	136
||	137
f	138
b)	139
do	140
i;	141
temp	142
-1	143
assign	144
increase	145
change	146
(x	147
modulo	148
variable	149
bool	150
num	151
add	152
n)	153
a[i];	154
q	155
c,	156
c;	157
as	158
4	159
min	160
break	161
t;	162
N	163
z	164
max	165
following	166
mod	167
5	168
(	169
,	170
++i)	171
)	172
"\n";	173
(k	174
result	175
character	176
elements	177
constant	178
false	179
len	180
l,	181
-=	182
w	183
(j	184
output	185
y,	186
one	187
d;	188
s1	189
vector	190
(a[i]	191
into	192
s,	193
j,	194
element	195
i=0	196
void	197
maxn	198
ch	199
an	200
sort	201
ints	202
(long	203
s2	204
true;	205
end	206
y;	207
(b	208
7	209
10;	210
k)	211
3;	212
h	213
a[i	214
'\n';	215
false;	216
(s[i]	217
'	218
inclusive,	219
mx	220
1);	221
incrementing	222
b[i]	223
m)	224
arr[i]	225
longs	226
c)	227
tmp	228
returning	229
str	230
double	231
(cin	232
equals	233
a)	234
x)	235
e	236
arr	237
(c	238
t,	239
g	240
arguments	241
1])	242
values	243
d,	244
run	245
strings	246
at	247
variables	248
boolean	249
?	250
standard	251
(m	252
-1,	253
a[i][j]	254
:	255
y)	256
2,	257
Read	258
r,	259
make	260
'0'	261
i)	262
"\n"	263
p,	264
u	265
p;	266
vector<int>	267
mn	268
1e9	269
8	270
5;	271
j;	272
t1	273
a[0]	274
absolute	275
call	276
continue;	277
x1	278
start	279
r;	280
it	281
ans++;	282
s[0]	283
total	284
NO	285
argument	286
first	287
/=	288
100	289
decrease	290
1];	291
(s	292
6	293
sum1	294
INF	295
minimum	296
mid	297
x2	298
that	299
s[i	300
c1	301
called	302
YES	303
'a'	304
st	305
(l	306
-1;	307
4;	308
index	309
t2	310
loop,	311
gcd	312
l;	313
pos	314
n);	315
cnt++;	316
arrays	317
append	318
A	319
b);	320
ans,	321
maximum	322
q;	323
define	324
sum2	325
3)	326
y1	327
ans;	328
are	329
MOD	330
'\n'	331
s[j]	332
v[i]	333
returns	334
a[1]	335
(y	336
even	337
1))	338
&	339
i=1	340
v;	341
ok	342
last	343
c2	344
a[j]	345
(t	346
i--)	347
2d	348
d)	349
7;	350
(sum	351
cur	352
stop	353
now	354
2]	355
1000	356
M	357
arr[i];	358
user	359
s.size();	360
name	361
(r	362
arguments,	363
push	364
maxx	365
ret	366
o	367
str;	368
*=	369
map	370
insert	371
int>	372
decrementing	373
y2	374
(ans	375
1][j]	376
(p	377
c++;	378
all	379
otherwise	380
a[n	381
characters	382
s1,	383
str[i]	384
inf	385
temp;	386
on	387
r)	388
counter	389
ans1	390
B	391
taking	392
105	393
continue	394
1e5	395
count++;	396
s[i];	397
true,	398
x1,	399
8;	400
s)	401
(2	402
tot	403
a1	404
(n--)	405
p1	406
a[2]	407
s.length();	408
ans2	409
N;	410
check	411
MAX	412
v,	413
2);	414
S	415
minn	416
h,	417
",	418
ss	419
i++;	420
iteration	421
sum,	422
'1'	423
j)	424
each	425
c[i]	426
val	427
++j)	428
(d	429
"NO\n";	430
long>	431
x[i]	432
"0"	433
w;	434
"-1"	435
v1	436
26	437
z;	438
%=	439
solve	440
times	441
'0';	442
s[1]	443
l)	444
p2	445
MAXN	446
(s[0]	447
T	448
unsigned	449
cost	450
left	451
b[i];	452
'0')	453
n1	454
mod;	455
x2,	456
10)	457
k++)	458
divide	459
(cnt	460
right	461
subtract	462
pointer	463
9	464
(arr[i]	465
z,	466
-1)	467
5)	468
R	469
s2;	470
sort(a,	471
t)	472
getchar();	473
101	474
"+------------------------+"	475
12	476
y1,	477
num;	478
len;	479
odd	480
i);	481
f,	482
answer	483
4)	484
=integers	485
second	486
a2	487
"YES\n";	488
takes	489
maxi	490
swap	491
n2	492
inline	493
3,	494
N,	495
p[i]	496
(s[j]	497
between	498
vector<long	499
L	500
{0};	501
b[j]	502
cont	503
no	504
different	505
j=0	506
s.size()	507
u,	508
";	509
t1,	510
reading	511
top	512
arr[i][j]	513
i]	514
6;	515
(temp	516
min(ans,	517
(flag	518
60	519
a[i][j];	520
mp	521
'*'	522
where	523
mini	524
7)	525
sum++;	526
w,	527
remove	528
dp[i	529
(t--)	530
C	531
d[i]	532
p)	533
'-')	534
arr[i	535
next	536
'1')	537
casted	538
10,	539
a[i])	540
q,	541
time	542
t[i]	543
argument,	544
beginning	545
1000000007	546
0x3f3f3f3f;	547
100;	548
"";	549
initialized	550
v0	551
curr	552
b[0]	553
v1,	554
max1	555
"NO\n"	556
c);	557
f;	558
D	559
both	560
e,	561
num1	562
two	563
bitwise	564
bytes	565
"YES\n"	566
0x3f3f3f3f	567
'R'	568
gcd(b,	569
s3	570
down	571
15	572
b1	573
20	574
truthy	575
"*";	576
k++;	577
((n	578
sum;	579
11	580
min(a,	581
(a[i][j]	582
(ch	583
integer,	584
y);	585
current	586
cnt1	587
'a']	588
"Yes"	589
prev	590
cnt2	591
getline(cin,	592
(flag)	593
j++;	594
exit	595
xx	596
mi	597
number	598
space	599
a);	600
ma	601
dp	602
A[i]	603
"1"	604
1000000007;	605
ct	606
empty	607
1005	608
num2	609
PI	610
dp[i]	611
1],	612
(str[i]	613
cnt,	614
vis	615
'-'	616
m);	617
"D";	618
s1[i]	619
(res	620
;	621
(num	622
1000;	623
'.'	624
tmp;	625
5,	626
substring	627
((i	628
(f	629
31,	630
"#";	631
pre	632
v)	633
position	634
b[i	635
s.length()	636
s[i][j]	637
arr[0]	638
{1,	639
max(ans,	640
110	641
map<string,	642
(a[i	643
res;	644
"No"	645
r[i]	646
step	647
v2	648
"#"	649
aux	650
x++;	651
dfs	652
diff	653
""	654
cnt;	655
false,	656
0);	657
vector<string>	658
out	659
100005	660
'A'	661
=integer	662
count1	663
"D"	664
k1	665
y2;	666
Max	667
zero	668
(a[0]	669
K	670
k);	671
c1,	672
100000	673
'+')	674
plus	675
X	676
pi	677
dy	678
{0,	679
30	680
a[n];	681
'o'	682
INT_MAX	683
up	684
f[i]	685
display	686
'*')	687
v[i	688
get	689
co	690
(w	691
'9')	692
long,	693
(1	694
1e6	695
pair	696
a[3]	697
dx	698
int,	699
'#'	700
show	701
'a';	702
7,	703
b[i])	704
num[i]	705
v[i];	706
rem	707
found	708
'+'	709
solve()	710
set<int>	711
a[k]	712
4,	713
a++;	714
f1	715
row	716
^	717
max)	718
e;	719
filled	720
"scissors"	721
g,	722
"paper"	723
arr[1]	724
((a	725
"I	726
return;	727
t2;	728
A,	729
"rock"	730
|	731
1001	732
y[i]	733
n1,	734
(b[i]	735
flag1	736
x);	737
25	738
n--;	739
1][j	740
s);	741
2))	742
r2	743
(v[i]	744
l[i]	745
rest	746
d1	747
(a[j]	748
reverse	749
ar	750
+------------------------+	751
(count	752
t2)	753
multiply	754
flag2	755
day	756
ans[i]	757
|=	758
b[i][j]	759
(;	760
can	761
iterate	762
p1,	763
tt	764
s1;	765
ch;	766
j--)	767
n-1	768
l1	769
aa	770
8)	771
multiple	772
idx	773
50	774
d2	775
(1)	776
st;	777
b2	778
(h	779
(q	780
back	781
j);	782
f2	783
cek	784
26;	785
=0	786
'9'	787
ar[i]	788
m1	789
'4'	790
a[i]);	791
s2,	792
y2)	793
t[0]	794
root	795
"First"	796
30,	797
c[i];	798
h;	799
"SEGMENT"	800
"Second"	801
'o')	802
EPS	803
ith	804
id	805
s2[i]	806
c[j]	807
1LL	808
200	809
endline	810
{}	811
INT_MAX;	812
".";	813
accepts	814
'B'	815
l2	816
t2,	817
max,	818
arr[2]	819
g;	820
l++;	821
p3	822
m2	823
mp;	824
base	825
a[i],	826
suma	827
dis	828
n=int	829
lo	830
col	831
s[j	832
(s1	833
k2	834
n2,	835
(v	836
bitshift	837
using	838
L,	839
order	840
a[i][j	841
2e5	842
r1	843
>>=	844
a[n]	845
"|O.......................|"	846
arr[n	847
1]);	848
d[i];	849
sz	850
score	851
(x1	852
min)	853
"PRINT	854
r++;	855
go	856
min1	857
solve();	858
"R"	859
nl	860
res++;	861
gcd(int	862
num,	863
p2,	864
(min	865
v.end());	866
'B')	867
6)	868
sum)	869
z)	870
#	871
arr[j]	872
"L"	873
min,	874
my	875
int64_t	876
'R')	877
b++;	878
vec	879
gcd(long	880
d);	881
x--;	882
map<int,	883
(z	884
isn't	885
MOD;	886
bb	887
B,	888
a1,	889
square	890
sy	891
kol	892
"*"	893
9;	894
12;	895
s.end());	896
55	897
(get	898
'#';	899
starting	900
test	901
true)	902
eps	903
j=1	904
mx,	905
ind	906
a.size();	907
p3,	908
M,	909
"TRIANGLE"	910
s1[0]	911
digit	912
temp2	913
ans)	914
'.')	915
lcm	916
y2,	917
10000	918
str[i	919
v0,	920
item	921
lower	922
m]	923
which	924
a3	925
c2;	926
{0}	927
hi	928
bit	929
np	930
t++;	931
sort(v.begin(),	932
K,	933
arr[n];	934
iterator	935
integers,	936
Y	937
prime	938
need	939
dif	940
x3	941
mid;	942
y++;	943
48	944
a[j	945
s1[1]	946
sol	947
decremented	948
temp1	949
20;	950
M;	951
r[i	952
count2	953
mark	954
abs	955
0))	956
'z'	957
(tmp	958
1e9;	959
temp,	960
f)	961
mm	962
"."	963
x2)	964
n,m	965
(x[i]	966
T;	967
swap(a,	968
skip	969
(x2	970
looping	971
gcd(a,	972
word	973
'D';	974
res,	975
t1)	976
cmp	977
a[0];	978
a[i][0]	979
"S"	980
V	981
((x	982
(N	983
low	984
'('	985
(u	986
(s.size()	987
k--;	988
nn	989
ex	990
chars	991
v[0]	992
count;	993
'D'	994
ii	995
clear	996
'U'	997
"M"	998
100001	999
valid	1000
power	1001
nl,	1002
(true)	1003
set<string>	1004
a[j];	1005
'*';	1006
str1	1007
yy	1008
a[x]	1009
b))	1010
s2)	1011
mn,	1012
(s[i	1013
fa	1014
sb	1015
x[0]	1016
"F"	1017
"U"	1018
a,b	1019
price	1020
u;	1021
num++;	1022
begin	1023
minx	1024
(s1[i]	1025
n++;	1026
false)	1027
stream	1028
s[n	1029
coun	1030
op	1031
S;	1032
cc	1033
m[i]	1034
'S'	1035
"IMPOSSIBLE"	1036
v2,	1037
"Friendship"	1038
pq	1039
x++)	1040
-1};	1041
str2	1042
abs(x	1043
'A')	1044
q)	1045
arr[i][j];	1046
A[i];	1047
np;	1048
remainder	1049
div	1050
OR	1051
a[4]	1052
erase	1053
t3	1054
'z')	1055
'8'	1056
resp	1057
b[1]	1058
s[i])	1059
dimensional	1060
(size_t	1061
(a[n	1062
"/"	1063
memset	1064
minus	1065
.	1066
Min	1067
"DOWN"	1068
"UP"	1069
1));	1070
sort(a	1071
'.';	1072
vis[i]	1073
move	1074
c[0]	1075
(e	1076
sizes	1077
360	1078
(c[i]	1079
'(')	1080
dist	1081
fl	1082
kk	1083
'L'	1084
x1)	1085
(pos	1086
(s2	1087
'#')	1088
v.size()	1089
v.size();	1090
s++;	1091
G	1092
statement	1093
(s[1]	1094
chest	1095
'1';	1096
through	1097
k]	1098
dem	1099
sx	1100
read()	1101
high	1102
max(a,	1103
(t1	1104
c[i][j]	1105
count,	1106
{0},	1107
float	1108
100)	1109
temp)	1110
Yes	1111
sum3	1112
(b)	1113
9)	1114
rows	1115
t[1]	1116
vectors	1117
shift	1118
m++;	1119
1};	1120
"-1\n";	1121
',	1122
s[2]	1123
c[1]	1124
a[1])	1125
a[0])	1126
h1	1127
Q	1128
1000000	1129
),	1130
endl,	1131
No	1132
a=array	1133
biceps	1134
ans=0	1135
until	1136
tmp,	1137
setting	1138
"LEFT"	1139
(a[1]	1140
fill	1141
1010	1142
str[j]	1143
k1,	1144
sizeof	1145
upper	1146
250)	1147
'8')	1148
map<long	1149
p++;	1150
flag;	1151
k2;	1152
(max	1153
divided	1154
mx)	1155
P	1156
memset(a,	1157
x[i];	1158
sort(arr,	1159
str[0]	1160
a2,	1161
b1,	1162
S[i]	1163
"RIGHT"	1164
"Akshat"	1165
WITH	1166
sizeof(a));	1167
10);	1168
(A	1169
'e'	1170
(sum1	1171
(n)	1172
*p	1173
(g	1174
hitung	1175
hate	1176
a[105];	1177
ss;	1178
type	1179
res1	1180
32	1181
(y2	1182
endl	1183
blue	1184
mn)	1185
keep	1186
"Malvika"	1187
y--;	1188
'\0';	1189
mult	1190
str,	1191
'W'	1192
ascending	1193
i2	1194
1),	1195
i))	1196
w[i]	1197
name[i]	1198
s[3]	1199
i=	1200
x[1]	1201
ck	1202
(now	1203
a[j])	1204
u)	1205
fb	1206
'V'	1207
pow(2,	1208
win	1209
j]	1210
tc	1211
y1)	1212
g[i]	1213
init	1214
0),	1215
'S')	1216
dp[0]	1217
Friendship	1218
tb	1219
abs(a[i]	1220
joy	1221
3);	1222
store	1223
n]	1224
a]	1225
counting	1226
con	1227
prime[j]	1228
stdout	1229
(c1	1230
"NO")	1231
'C'	1232
(cur	1233
further,	1234
days	1235
become	1236
I	1237
'T')	1238
puts("YES");	1239
'0');	1240
"?"	1241
s2[0]	1242
best	1243
cx	1244
T,	1245
e)	1246
sumb	1247
h[i]	1248
mod)	1249
red	1250
min(x,	1251
"TEAM	1252
A;	1253
d++;	1254
after	1255
reference	1256
'0',	1257
abs(a	1258
fuel	1259
'P'	1260
map<char,	1261
60;	1262
re	1263
k[i]	1264
gap	1265
even,	1266
pass	1267
TESTS	1268
cnt)	1269
n[i]	1270
a[i][1]	1271
22	1272
min(b,	1273
s3)	1274
precision	1275
c3	1276
tmp2	1277
97	1278
v[n	1279
sort(s.begin(),	1280
(s[i][j]	1281
ac	1282
strlen(s);	1283
exit(0);	1284
a.length();	1285
'4')	1286
unique	1287
booleans	1288
v[j]	1289
3]	1290
nothing	1291
W	1292
s[i+1]	1293
prime[i]	1294
'g'	1295
ta	1296
num)	1297
exp	1298
s1)	1299
(t[i]	1300
hh	1301
max(mx,	1302
infinite	1303
2e9	1304
sm	1305
2])	1306
sum1,	1307
len,	1308
sum[i]	1309
i++,	1310
"Oh,	1311
puts("NO");	1312
0};	1313
'7')	1314
o,	1315
address	1316
x[j]	1317
flag,	1318
1][0]	1319
1][1]	1320
ctr	1321
ff	1322
p]	1323
space,	1324
(180	1325
dp[i][j]	1326
'['	1327
s[0];	1328
2];	1329
l);	1330
columns	1331
'?'	1332
Terminate	1333
tm	1334
n,k	1335
contents	1336
"woman"	1337
dfs(int	1338
11;	1339
{};	1340
(getline(cin,	1341
t);	1342
oo	1343
i+1	1344
((b	1345
i1	1346
100,	1347
row[i]	1348
1;;	1349
calling	1350
half	1351
pow	1352
15)	1353
(arr[i][j]	1354
"Friendship	1355
':')	1356
4);	1357
se	1358
odd,	1359
items	1360
1.0	1361
open	1362
bs	1363
color	1364
md	1365
inp	1366
green	1367
((k	1368
does	1369
(it	1370
'C')	1371
y))	1372
min2	1373
A[i	1374
b[i][j	1375
pair<int,	1376
prog[i]	1377
';	1378
a[maxn];	1379
10]	1380
doubles	1381
1e18	1382
(len	1383
(y1	1384
tx	1385
998244353	1386
"Ehab"	1387
n/2	1388
(3	1389
|O.......................|	1390
br	1391
B;	1392
str.size();	1393
l++)	1394
a++)	1395
ans);	1396
(0);	1397
8,	1398
'i'	1399
m))	1400
fast	1401
file	1402
fixed	1403
100010	1404
queue	1405
further	1406
'a')	1407
^=	1408
a.size()	1409
moves	1410
it;	1411
truthy,	1412
guy."	1413
keyboard!"	1414
ret;	1415
(q--)	1416
'Q')	1417
'o',	1418
vec[i]	1419
1e3	1420
a[i-1]	1421
h)	1422
"CHAT	1423
"IGNORE	1424
(n1	1425
v(n);	1426
(n);	1427
p[i];	1428
1]]	1429
(arr[i	1430
]	1431
1000000000	1432
a[x	1433
(a1	1434
"Mahmoud"	1435
cn	1436
num3	1437
d1,	1438
p);	1439
'\0'	1440
flg	1441
s[k]	1442
a[i+1]	1443
ty	1444
yes	1445
"Anton"	1446
"Danik"	1447
maxm	1448
dp[1]	1449
int)	1450
-x	1451
love	1452
int>::iterator	1453
a--;	1454
set<char>	1455
max;	1456
'D')	1457
val;	1458
a[j][i]	1459
data	1460
64	1461
C,	1462
ara[i]	1463
180	1464
base)	1465
"Mishka"	1466
"Chris"	1467
'K'	1468
u2	1469
ad	1470
(1LL	1471
p1;	1472
t1;	1473
read();	1474
'L')	1475
letter	1476
p[0]	1477
31	1478
compare	1479
key	1480
s4	1481
c2,	1482
"RU"	1483
pos,	1484
1]))	1485
str.length();	1486
cou	1487
x2;	1488
number;	1489
input;	1490
y1;	1491
getchar()	1492
arr[3]	1493
p[i	1494
find	1495
=1	1496
fin	1497
100000;	1498
200005	1499
ara	1500
(p[i]	1501
front	1502
dp[i][1]	1503
magic!^^"	1504
WINS"	1505
a(n);	1506
y[i];	1507
x1;	1508
i--;	1509
998244353;	1510
s=string	1511
Set	1512
"RD"	1513
"LD"	1514
"LU"	1515
cy	1516
bl	1517
{2,	1518
s[pos]	1519
b[j])	1520
a[n],	1521
(cnt1	1522
it++)	1523
s))	1524
acos(-1.0);	1525
case	1526
res2	1527
H,	1528
'r'	1529
MX	1530
{-1,	1531
x[i	1532
a[0],	1533
tmp1	1534
c))	1535
INT_MAX,	1536
((c	1537
min(n,	1538
distance	1539
i])	1540
(A[i]	1541
ax	1542
(x)	1543
"2"	1544
counter++;	1545
ar[i];	1546
"R";	1547
"L";	1548
mx;	1549
invoke	1550
n+1	1551
pr	1552
U	1553
res[i]	1554
s2[1]	1555
n2)	1556
Ans	1557
1][n	1558
(num[i]	1559
t3;	1560
"back"	1561
min(dp[i	1562
((a[i]	1563
b++)	1564
32;	1565
5];	1566
strlen(a);	1567
r);	1568
K;	1569
1][j];	1570
counts	1571
'-',	1572
T1	1573
point	1574
h2	1575
abs(y	1576
myset	1577
"-1\n"	1578
(left	1579
f[i	1580
Count	1581
level	1582
n2;	1583
(exclusive)	1584
med	1585
S1	1586
"Correct"	1587
a[105],	1588
"chest"	1589
"biceps"	1590
20)	1591
max(x,	1592
(ok)	1593
s[j];	1594
30;	1595
'a']++;	1596
tem	1597
(l[i]	1598
2005	1599
c1[1]	1600
round	1601
rlmoves	1602
b2,	1603
"5"	1604
col[j]	1605
proceed	1606
pop	1607
'U')	1608
z[i]	1609
'7'	1610
ai	1611
')	1612
sort(b,	1613
u1	1614
min(mn,	1615
acos(-1);	1616
j--;	1617
"U";	1618
size;	1619
'l')	1620
num[i];	1621
"0";	1622
su	1623
maxn,	1624
same	1625
three	1626
judge	1627
(length	1628
x[2]	1629
jj	1630
starty	1631
abs(j	1632
n))	1633
abs(i	1634
dir	1635
stringstream	1636
13	1637
dp[n	1638
v1)	1639
ed	1640
k))	1641
temp++;	1642
R;	1643
v.push_back(x);	1644
v1;	1645
'z';	1646
')')	1647
arr[i])	1648
120	1649
points	1650
st,	1651
cs	1652
ls	1653
xs	1654
q[i]	1655
a[k	1656
curlower	1657
ds	1658
20,	1659
"Misha"	1660
"Vasya"	1661
int(0);	1662
'G')	1663
en	1664
51	1665
max_i	1666
6,	1667
'u'	1668
isPrime	1669
a[5]	1670
(mid	1671
fx	1672
200000	1673
b),	1674
turn	1675
lim	1676
(360	1677
s2[i	1678
dp[i][2]	1679
"Karen"	1680
HER!"	1681
"Tie"	1682
s[j])	1683
p2;	1684
'Z')	1685
(!flag)	1686
(k--)	1687
t[i];	1688
i=2	1689
102	1690
(r[i]	1691
register	1692
ch1	1693
initialize	1694
rounded	1695
imax	1696
s[5]	1697
a[l]	1698
uneven	1699
max(0,	1700
((y	1701
'W')	1702
S,	1703
val2	1704
year	1705
var	1706
max2	1707
u1,	1708
HIM!"	1709
pos1	1710
check(int	1711
d2;	1712
W,	1713
':'	1714
s[4]	1715
arr[i][1]	1716
c=0	1717
86400	1718
f++;	1719
'B';	1720
48;	1721
a.end());	1722
s[i][j];	1723
maxn;	1724
temp);	1725
ans1,	1726
l1,	1727
500	1728
copy	1729
c2[0]	1730
abs(b	1731
ele	1732
((r	1733
ta,	1734
(a)	1735
105;	1736
init()	1737
sa	1738
reset	1739
mul	1740
240	1741
12)	1742
name;	1743
(m--)	1744
a[3];	1745
'?')	1746
big	1747
bits	1748
b[2]	1749
goto	1750
sum=0	1751
ch2	1752
maxs	1753
tp	1754
squared	1755
ll	1756
has	1757
cnt[i]	1758
in;	1759
'G'	1760
y3	1761
Second	1762
form	1763
dp[j]	1764
DOWN	1765
UP	1766
'Q'	1767
max(3	1768
((j	1769
(b[j]	1770
--i)	1771
sqrt(n);	1772
str2;	1773
0;;	1774
c1++;	1775
a[110];	1776
"O.";	1777
(char	1778
v[1]	1779
stack	1780
large	1781
First	1782
dp[i][0]	1783
iter	1784
(mx	1785
summ	1786
1][0],	1787
'r')	1788
dy[]	1789
memset(vis,	1790
b--;	1791
mn;	1792
c));	1793
1]++;	1794
"#.";	1795
"rat")	1796
v);	1797
base,	1798
__gcd	1799
max_j	1800
increasing	1801
nx	1802
sign	1803
1000005	1804
short	1805
p[i].first	1806
c2)	1807
(last	1808
b[n	1809
'l'	1810
lst	1811
')'	1812
n,m=int	1813
d[i	1814
dp[0][0]	1815
(a[i])	1816
respectively	1817
fi	1818
tim	1819
act	1820
w2	1821
val1	1822
1][y]	1823
'h'	1824
reduce	1825
MIN	1826
1e18;	1827
(f)	1828
getchar())	1829
m--;	1830
dx[]	1831
cnt);	1832
z++;	1833
'R';	1834
r--;	1835
str[i];	1836
v0;	1837
min_j	1838
last)	1839
push_back	1840
put	1841
ar[0]	1842
(m)	1843
isprime	1844
primes	1845
p[i].second	1846
d[x	1847
dp[j][k]	1848
t[i	1849
ada	1850
T[i]	1851
pl	1852
cal	1853
"man")	1854
"0	1855
S2	1856
(a[n]	1857
pw	1858
sum2)	1859
ans--;	1860
c++)	1861
5);	1862
min;	1863
p++)	1864
(T--)	1865
min_i	1866
9,	1867
n--	1868
y[j]	1869
st[i]	1870
a[0][1]	1871
w)	1872
B[i]	1873
returned	1874
ar[i][j]	1875
yt	1876
b3	1877
"#Black&White"	1878
a,b,c	1879
menor	1880
'1',	1881
sp	1882
rs	1883
250	1884
signed	1885
1000000007)	1886
(s3	1887
changing	1888
numOps	1889
fast()	1890
pos2	1891
test1	1892
s2[i])	1893
c1)	1894
b[j];	1895
t++)	1896
s[1];	1897
L;	1898
int[n];	1899
arr[i]);	1900
1000000;	1901
queue<int>	1902
mp[s]	1903
write	1904
(diff	1905
st)	1906
y[0]	1907
s[i],	1908
s[i-1]	1909
+1	1910
size_t	1911
ys	1912
li	1913
its	1914
abs(y1	1915
flag=0	1916
ans[i	1917
cnt=0	1918
s[0],	1919
maxa	1920
match	1921
((s	1922
'T'	1923
tb)	1924
u2,	1925
"Equal"	1926
matches	1927
o;	1928
r[i];	1929
sort(a.begin(),	1930
q++)	1931
aux;	1932
result;	1933
cnt1++;	1934
10];	1935
a[100005];	1936
10000;	1937
'W';	1938
11)	1939
u[i]	1940
"",	1941
R,	1942
s[i][j	1943
-1}	1944
now[1]	1945
((m	1946
decreasing	1947
a3,	1948
strlen	1949
"#Color"	1950
(4	1951
m[i	1952
(st	1953
ca	1954
ones	1955
multiplied	1956
tam	1957
'<'	1958
"Too	1959
positive	1960
q1	1961
t[2]	1962
"4"	1963
ql	1964
ans[i][j]	1965
(str[j]	1966
(k)	1967
(s.length()	1968
weight	1969
sizeof(vis));	1970
cmp(int	1971
a[1005];	1972
"child")	1973
tot++;	1974
getchar	1975
'\n',	1976
(7	1977
winner	1978
ch[i]	1979
arr,	1980
freq	1981
startx	1982
cot	1983
maxx,	1984
xf	1985
pp	1986
modulus	1987
least	1988
27	1989
(b[0]	1990
memset(b,	1991
containing	1992
cup	1993
v[i])	1994
first,	1995
sumy	1996
remaining	1997
ay	1998
"that	1999
"Mind"	2000
"O-|-OOOO"	2001
(tot	2002
qr	2003
mxm	2004
13)	2005
ans2)	2006
cmp);	2007
set<long	2008
t--;	2009
cnt--;	2010
a[N];	2011
'L';	2012
arr[0];	2013
vector<char>	2014
s1.length();	2015
pos;	2016
++ans;	2017
mat[i][j]	2018
inlined	2019
MN	2020
sieve	2021
now,	2022
2000	2023
c1[0]	2024
b[0])	2025
A[i][j]	2026
1e-9	2027
itr	2028
min(res,	2029
H	2030
sumz	2031
ny	2032
w1	2033
vv	2034
S3	2035
long)	2036
lenb	2037
mnm	2038
dp0	2039
s[1])	2040
init();	2041
1e-9;	2042
15;	2043
(!q.empty())	2044
word;	2045
execute	2046
lol	2047
ms	2048
V[i]	2049
input[i]	2050
d))	2051
sq	2052
prime[i	2053
maxy	2054
diff2	2055
a[t]	2056
(a[2]	2057
a[s[i]	2058
le	2059
matrix	2060
in[i]	2061
5001	2062
min(l,	2063
22)	2064
final	2065
};	2066
cur;	2067
(register	2068
++i;	2069
y++)	2070
C;	2071
'P')	2072
'[')	2073
it->second	2074
b[i],	2075
maps	2076
16	2077
ss[i]	2078
&=	2079
'M'	2080
"-"	2081
p[j]	2082
(s1[0]	2083
y[1]	2084
udmoves	2085
ar[i	2086
left,	2087
a[r]	2088
hi2	2089
string>	2090
lena	2091
head	2092
k=0	2093
s3,	2094
arr2	2095
req	2096
(no	2097
arr[i][0]	2098
cd	2099
(total	2100
len)	2101
weak"	2102
abs(fa	2103
abs(1	2104
1000000009	2105
"Dasha"	2106
bt	2107
N)	2108
swap(x,	2109
2));	2110
v2)	2111
CUR	2112
s.size())	2113
a[100];	2114
(ar[i]	2115
++k)	2116
t.size();	2117
power(long	2118
n;)	2119
b.size();	2120
aa,	2121
cp	2122
'a',	2123
"NO",	2124
method	2125
contains	2126
str1,	2127
S)	2128
more	2129
(integer	2130
total,	2131
(arr[0]	2132
c[i	2133
t[1])	2134
lt	2135
ant	2136
str[i][j]	2137
answ	2138
len2	2139
having	2140
ya	2141
a[i].second	2142
(sx	2143
(t)	2144
(arr[j]	2145
arr[i][j	2146
nonzero	2147
Mishka	2148
Chris	2149
"Incorrect"	2150
35	2151
"Power"	2152
"Time"	2153
"Space"	2154
"Soul"	2155
"Reality"	2156
"Masha"	2157
min3	2158
a[100],	2159
sizeof(b));	2160
'K')	2161
w[i];	2162
"/",	2163
a[1],	2164
good	2165
f1,	2166
num1,	2167
(sum2	2168
p2)	2169
'p'	2170
decimal	2171
aux1	2172
now[0]	2173
f[1]	2174
abs(x)	2175
(s1[1]	2176
s2[1])	2177
rx	2178
d[0]	2179
x0	2180
[	2181
2001	2182
sum2,	2183
c),	2184
largest	2185
jum	2186
65	2187
(o	2188
xb	2189
bi	2190
dig	2191
a[0][i]	2192
1][j])	2193
1][y	2194
tb,	2195
abs(ta	2196
jumlah	2197
"Howard"	2198
{},	2199
28,	2200
participants	2201
ch)	2202
max(m,	2203
cin.ignore();	2204
b[i]);	2205
last;	2206
v2;	2207
c--;	2208
a3;	2209
a[1];	2210
b[n];	2211
q);	2212
l--;	2213
22;	2214
s1.size();	2215
1000000009;	2216
(val	2217
T2	2218
P1	2219
(t2	2220
c[2]	2221
a[2])	2222
's'	2223
acosign	2224
10005	2225
abs(y2	2226
t[0])	2227
pairs	2228
s2[0])	2229
num_start	2230
l[n]	2231
y0	2232
every	2233
diff1	2234
len1	2235
(maxx	2236
ysum	2237
mmax	2238
ini	2239
(position	2240
(5	2241
sumc	2242
A[0]	2243
2],	2244
dp[n]	2245
INT_MIN	2246
high)	2247
((sum	2248
">"	2249
minn)	2250
(s2[i]	2251
"GOTO	2252
st.size()	2253
"Leonard",	2254
"Penny",	2255
"Rajesh",	2256
width	2257
rta	2258
max(maxx,	2259
second;	2260
vector<bool>	2261
num2;	2262
"NO";	2263
(str	2264
int(n);	2265
b));	2266
q.pop();	2267
greater<int>());	2268
"Yes\n";	2269
48);	2270
m[0]	2271
_tc	2272
p[1]	2273
lowercase	2274
save	2275
(p1	2276
"+"	2277
1ll	2278
d2)	2279
xx,	2280
xmax	2281
imin	2282
B)	2283
24	2284
21	2285
(dp[i	2286
Create	2287
str.size()	2288
200001	2289
freq[i]	2290
sd	2291
x=0	2292
Input	2293
program	2294
(c)	2295
x3,	2296
ct2	2297
nb	2298
nums	2299
MOD)	2300
"<"	2301
mx2	2302
et	2303
fa,	2304
place	2305
time1	2306
m[a[i	2307
dp1	2308
whichPosn	2309
(S[i]	2310
s[i]);	2311
(it->second	2312
k[i];	2313
s3;	2314
c[i][j];	2315
s[3];	2316
s[2];	2317
fast();	2318
s4;	2319
ty)	2320
1005;	2321
++cnt;	2322
(b[i	2323
a[101],	2324
flag++;	2325
"|";	2326
INT_MIN;	2327
((l	2328
'Z'	2329
1e8	2330
ceil	2331
123	2332
active	2333
string,	2334
S[0]	2335
sqrt	2336
r1,	2337
flag1,	2338
gcd(b	2339
ti	2340
"1	2341
gr	2342
ifstream	2343
3e5	2344
solve(int	2345
hasil	2346
sum[i	2347
1][k	2348
sub	2349
temp1,	2350
b[k]	2351
state	2352
bool)	2353
sumx	2354
ct1	2355
"UR"	2356
(op	2357
v1[i]	2358
arr1[i]	2359
arr2[i]	2360
(c[i][j]	2361
(f1	2362
man	2363
s1[i	2364
magic!^^	2365
((s[i]	2366
Sum	2367
(index	2368
bigger	2369
inches	2370
tar	2371
g)	2372
distanc	2373
prev)	2374
"contest"	2375
cntr	2376
maxx)	2377
100001;	2378
n1;	2379
mm;	2380
cont++;	2381
e++;	2382
inp;	2383
x.size();	2384
xx;	2385
"0\n";	2386
a[],	2387
"captain")	2388
'-';	2389
tc;	2390
'5')	2391
"1";	2392
qr;	2393
val)	2394
character,	2395
1000,	2396
1e2	2397
other	2398
a))	2399
num[0]	2400
rr	2401
gg	2402
101,	2403
(b1	2404
h1,	2405
"Ciel"	2406
bottom	2407
"O."	2408
(v0	2409
10000000	2410
201	2411
ts	2412
ans.size()	2413
y[i])	2414
gl	2415
"rat"	2416
Output	2417
3])	2418
a[m	2419
men	2420
args,	2421
"Still	2422
"r",	2423
(cast	2424
60)	2425
b[r	2426
am	2427
la	2428
bottles	2429
rep	2430
"home"	2431
7);	2432
16)	2433
1e6;	2434
(a[j][i]	2435
a[10];	2436
cnt2++;	2437
200;	2438
a[1000];	2439
memset(dp,	2440
GCD	2441
-2	2442
'B',	2443
'9',	2444
min1,	2445
501	2446
a[6]	2447
label	2448
(result	2449
1}	2450
code	2451
v[i][j]	2452
pointed	2453
aux2	2454
96	2455
invert	2456
5000	2457
endx	2458
str[count]	2459
a[i][k]	2460
sc	2461
contador	2462
ans[j]	2463
"EASY"	2464
"HARD"	2465
(x3	2466
num[i	2467
"child"	2468
"\n",	2469
status	2470
infinitely	2471
maxN	2472
ri	2473
res)	2474
x[i],	2475
max(dp[i	2476
hi)	2477
s.substr(0,	2478
second,	2479
inch	2480
tmp)	2481
1][i]	2482
'Q',	2483
adding	2484
a[1000],	2485
p4	2486
0"	2487
arg2	2488
poly	2489
qq	2490
(s[k]	2491
ans3	2492
v.push_back(a);	2493
'U';	2494
vec;	2495
x2);	2496
1001;	2497
r++)	2498
2};	2499
b3;	2500
lcm(long	2501
top;	2502
"No\n";	2503
a[2];	2504
INT_MAX)	2505
c2++;	2506
(unsigned	2507
++pos;	2508
adj	2509
book	2510
105,	2511
int(1e9	2512
l[i])	2513
P2	2514
exclusive)	2515
there	2516
X,	2517
jump	2518
fix	2519
ch,	2520
a[3])	2521
-1.0	2522
cnt3	2523
num[1]	2524
steps	2525
dc	2526
xt	2527
maxi,	2528
abs(x1	2529
leaf	2530
60,	2531
1e4	2532
(rem	2533
m1,	2534
(B	2535
"Hanako"	2536
limit	2537
sup	2538
29	2539
sumA	2540
220	2541
n),	2542
speed	2543
"#."	2544
(i)	2545
OO	2546
s.begin()	2547
dist[i]	2548
NeedTime	2549
dp[j	2550
contiguous	2551
exist	2552
done	2553
static	2554
gcd(y,	2555
shu	2556
j1	2557
(low	2558
mx1	2559
(lo	2560
48)	2561
carry	2562
ats	2563
Number	2564
"cw"	2565
"ccw"	2566
10),	2567
time2	2568
"it"	2569
-2,	2570
max((3	2571
"TIE"	2572
y));	2573
f2;	2574
(ans1	2575
w);	2576
"YES";	2577
ct++;	2578
stdin);	2579
s[n];	2580
(str[0]	2581
count--;	2582
priority_queue<int>	2583
i));	2584
X;	2585
b[i][j];	2586
vis[1]	2587
index,	2588
'/'	2589
start,	2590
'e',	2591
16,	2592
jth	2593
ch[i][j]	2594
arr=array	2595
M)	2596
acos(-1)	2597
amount	2598
str[1]	2599
v[2]	2600
swap(b,	2601
x[3]	2602
vec[i	2603
plen	2604
ymin	2605
=string	2606
miny	2607
(absolute	2608
mov	2609
arr1	2610
a[m]	2611
resize	2612
(not	2613
l[i][j]	2614
money	2615
(base	2616
send	2617
xsum	2618
acos	2619
counta	2620
flag=1	2621
n,k=int	2622
1][2]	2623
'h')	2624
1},	2625
a[n][n]	2626
mishka	2627
Rozdil"	2628
Correct	2629
"Alice"	2630
v.end(),	2631
"Bear"	2632
"Elephant"	2633
ceil(n	2634
"Penny"	2635
a.length()	2636
s[s.size()	2637
(kol	2638
(s[j][i]	2639
total;	2640
str);	2641
m.begin();	2642
(num1	2643
sum2;	2644
"rock")	2645
"scissors")	2646
q++;	2647
i];	2648
a[101];	2649
1000000000;	2650
"O";	2651
s[5];	2652
0LL	2653
tp1	2654
workTime	2655
t[3]	2656
ln	2657
Way	2658
a[3],	2659
tr	2660
1]),	2661
good[i]	2662
str2[i]	2663
l2)	2664
xmin	2665
ymax	2666
ok[i]	2667
mid)	2668
mod,	2669
1"	2670
"|#.#.#.#.#.#.#.#.#.#.#.|.|)"	2671
t2[i]	2672
(counter	2673
'O'	2674
cakes	2675
mid,	2676
','	2677
13,	2678
ans[0]	2679
b]	2680
d[j]	2681
"man"	2682
j=i	2683
mmin	2684
min(b	2685
na	2686
a[1][i]	2687
y[2]	2688
z1	2689
es	2690
(first	2691
_min	2692
salt	2693
arr[k]	2694
TEAM	2695
fact	2696
(a[2	2697
bitwise-or	2698
banyak	2699
"Sheldon"	2700
"Rajesh"	2701
{"Sheldon",	2702
s.substr(i,	2703
cap	2704
min(a	2705
(v[0]	2706
ANS	2707
*a	2708
frest	2709
maxn)	2710
dfs(i);	2711
l2;	2712
col;	2713
p3;	2714
b[0];	2715
"NO\n");	2716
"paper")	2717
123;	2718
97;	2719
v.push_back(i);	2720
mx);	2721
'O';	2722
ara[i];	2723
min(minn,	2724
101;	2725
INF;	2726
inf;	2727
(exp	2728
s[4];	2729
"RIGHT\n";	2730
"LEFT\n";	2731
nl;	2732
'u')	2733
vec[i];	2734
s2[j]	2735
visited,	2736
sizeof(a)	2737
v[x]	2738
(gap	2739
ch[j]	2740
"1/1"	2741
newline,	2742
n[0]	2743
n[1]	2744
spf[i]	2745
m[s]	2746
input,	2747
205	2748
sw	2749
abs(x2	2750
g[l	2751
normal	2752
mark[i]	2753
'*',	2754
f[i][j]	2755
a[p]	2756
printing	2757
mp[a[i]]	2758
mo	2759
dfs(i,	2760
Anton	2761
zz	2762
d[j	2763
mins	2764
A[j]	2765
val,	2766
(x[0]	2767
lucky	2768
nd	2769
m-1	2770
bitwise-and	2771
bob	2772
((2	2773
max1,	2774
f3	2775
(d[i]	2776
pos)	2777
n3	2778
_s	2779
1][1],	2780
x3)	2781
WINS	2782
'0']	2783
'8',	2784
"UL"	2785
"25"	2786
arr[b]	2787
(start	2788
abs(s[i]	2789
26)	2790
bj	2791
"Leonard"	2792
t[i])	2793
(int)1e9	2794
part	2795
tmo	2796
cards	2797
tempm	2798
sumr	2799
mask	2800
lessons	2801
(aa[i]	2802
bb[i]	2803
Bulbasaur	2804
a[N],	2805
m.end();	2806
sum);	2807
++count;	2808
strlen(str);	2809
y2);	2810
reverse(s.begin(),	2811
h2;	2812
maxx;	2813
h++;	2814
21)	2815
'<')	2816
su2	2817
visit	2818
rem,	2819
lsum	2820
m[1]	2821
s[i][0]	2822
discard	2823
'A',	2824
otherwise,	2825
If	2826
k[j]	2827
e[i]	2828
interval	2829
a[k])	2830
acos(-1.0)	2831
1e9,	2832
c2[1]	2833
bb,	2834
1.0)	2835
arr[j	2836
yf	2837
condition	2838
err	2839
(str[i	2840
data[i]	2841
count)	2842
row,	2843
Mahmoud	2844
Ehab	2845
"3"	2846
value)	2847
yb	2848
sumB	2849
'}'	2850
quotient	2851
Danik	2852
s[l]	2853
l[i	2854
arr[i].first	2855
Solve	2856
__gcd(a,	2857
arr[a]	2858
(in	2859
max_n	2860
jumlahgenap	2861
a[p	2862
(-1)	2863
words	2864
tot2	2865
rec	2866
abs(n	2867
(X	2868
kq	2869
'>'	2870
side	2871
falsy	2872
(-1	2873
star	2874
maxcnt	2875
"Time",	2876
"Space",	2877
"Soul",	2878
"Reality",	2879
1LL)	2880
Vasilisa."	2881
'!'	2882
"Alien"	2883
max(b,	2884
Vasya	2885
(R	2886
LEFT	2887
flog	2888
25)	2889
mxv	2890
(a[i][j	2891
swapped	2892
arg1	2893
min(i,	2894
(n[i]	2895
fathercnt[x]	2896
l2]	2897
t[r]=true	2898
P;	2899
f(int	2900
f[i];	2901
(!vis[i])	2902
z);	2903
S[i];	2904
a[maxn],	2905
fb;	2906
-x;	2907
test++;	2908
t[r]	2909
s1[j]	2910
v[b]	2911
cur,	2912
s[j][i]	2913
_x	2914
P3	2915
used	2916
den	2917
a[2][1]	2918
clock	2919
finall	2920
Z	2921
Z[i]	2922
prevc	2923
nan	2924
ma,	2925
(cnt2	2926
E	2927
1e7	2928
mode	2929
dr	2930
d[1]	2931
2e9,	2932
l2,	2933
letter_start	2934
i1,	2935
b[1])	2936
1000001	2937
b3,	2938
"|#.......................|"	2939
A)	2940
Blue	2941
nex	2942
Arr	2943
-a	2944
max(l,	2945
ways	2946
dep	2947
fa[i]	2948
priority_queue	2949
R)	2950
a1)	2951
low,	2952
18	2953
list	2954
np,	2955
2),	2956
'y')	2957
game	2958
A[1]	2959
tot1	2960
"="	2961
((d	2962
ab	2963
timr	2964
maxv	2965
m[i][j]	2966
rat	2967
300	2968
votes	2969
(y)	2970
divis	2971
"Bob"	2972
w1,	2973
"w",	2974
(L	2975
p[i][1]	2976
'>',	2977
hash1	2978
hash2	2979
RIGHT	2980
home	2981
"Impossible"	2982
location	2983
mp[x	2984
levels	2985
36	2986
x[n	2987
a[j][0]	2988
s.end(),	2989
mn2	2990
o)	2991
extra0	2992
m])	2993
en;	2994
500;	2995
50;	2996
&b)	2997
fixed;	2998
now;	2999
c1;	3000
a[4];	3001
(TESTS--)	3002
tmp2;	3003
abs(x);	3004
abs(y);	3005
test;	3006
a[n][m];	3007
tmp++;	3008
(strcmp(str,	3009
min(long	3010
temp2;	3011
'?';	3012
(a[k	3013
"Tetrahedron")	3014
"Cube")	3015
"Octahedron")	3016
"Dodecahedron")	3017
"Correct\n";	3018
31;	3019
visited[i]	3020
prev,	3021
vis[x]	3022
tdiff	3023
tp2	3024
fun	3025
p1)	3026
sqrt(n)	3027
a[n-1]	3028
0}	3029
a[2	3030
(8	3031
box	3032
index1	3033
ar[1]	3034
cnt1,	3035
ep	3036
ns	3037
deg	3038
arr[x]	3039
puts	3040
D,	3041
a[y]	3042
pre[i]	3043
pointers	3044
a4	3045
mini,	3046
str[len	3047
maxi2	3048
"No	3049
((p	3050
s[i-2]	3051
'S',	3052
arr[i],	3053
flag[i]	3054
0th	3055
(y3	3056
s.end())	3057
a3)	3058
xx[i]	3059
5005	3060
400	3061
comp	3062
memset(c,	3063
14	3064
19	3065
(0	3066
ver	3067
150	3068
p[n	3069
present	3070
max(res,	3071
a2)	3072
minm	3073
in,	3074
depth	3075
negative	3076
players[index]	3077
Alex"	3078
minP	3079
(red	3080
'T',	3081
Cnt	3082
nor	3083
1][j]]	3084
0},	3085
(count1	3086
f(n,	3087
pb	3088
right)	3089
lca	3090
fans	3091
"Koyomi"	3092
most	3093
(10	3094
larger	3095
'<',	3096
aj	3097
s0	3098
(S	3099
Minb	3100
(row[i]	3101
m[u]	3102
rm	3103
grest	3104
s[whichPosn	3105
(f[i]	3106
prohibited	3107
s[105];	3108
&a,	3109
stdout);	3110
x1++;	3111
step;	3112
yy;	3113
a1;	3114
cin.get();	3115
((ch	3116
b.end());	3117
tmp);	3118
a[j]);	3119
(curr	3120
(arr[i][j	3121
(a.size()	3122
(1);	3123
ssum	3124
ans2,	3125
(prev	3126
without	3127
'z',	3128
vis[j]	3129
smaller	3130
comparator	3131
28	3132
-1e9	3133
s[j],	3134
c]	3135
mp[i]	3136
1001,	3137
c3,	3138
ar[3]	3139
ss,	3140
ctx	3141
c(i)	3142
primes[i	3143
f[2]	3144
aa;	3145
str1[i]	3146
letter_dest	3147
max1)	3148
999999	3149
((a[i	3150
xay	3151
kh	3152
isPrime(int	3153
kanan	3154
s[a]	3155
MAX_N	3156
del	3157
buff	3158
10010	3159
b.size())	3160
(dif	3161
acum	3162
k3	3163
alpha	3164
(check	3165
j=	3166
min(n	3167
n,x	3168
__gcd(g,	3169
sum1)	3170
abs(2	3171
data2	3172
t1[i]	3173
arr[x	3174
Mod	3175
p=0	3176
(sy	3177
xxx	3178
s[pos	3179
=0,	3180
strlen(s)	3181
2e6	3182
180)	3183
K[i]	3184
abs(c	3185
(((y	3186
a[x][y	3187
ac,	3188
np)	3189
a,b=int	3190
(26	3191
maxl	3192
misha	3193
s[s.length()	3194
ql,	3195
wait	3196
p4,	3197
Incorrect	3198
qmarks	3199
i=n-1	3200
chris	3201
g2	3202
maxSize	3203
max_	3204
st1	3205
(9	3206
_n	3207
x[i])	3208
sisa	3209
(arr[n	3210
(st[i]	3211
maxi)	3212
(ac	3213
(ex	3214
b[105];	3215
gets(s);	3216
bool>	3217
Y;	3218
d1)	3219
110;	3220
count1++;	3221
kol++;	3222
d));	3223
ii++)	3224
arr[105];	3225
"+------------------------+";	3226
q.front();	3227
sum1++;	3228
f);	3229
z++)	3230
(v.size()	3231
"+";	3232
minn;	3233
solve(long	3234
a[x]++;	3235
line;	3236
tt;	3237
bo	3238
cur)	3239
"1/2"	3240
a[7]	3241
505	3242
arr[n]	3243
stdin	3244
one,	3245
a[2],	3246
v.begin()	3247
"YES",	3248
':',	3249
lens	3250
kkk	3251
nw	3252
tstep	3253
goal[0]	3254
O	3255
1005,	3256
num[j]	3257
endy	3258
hang	3259
1000010	3260
fy,	3261
m[x]	3262
c[k]	3263
(ith	3264
v[3]	3265
p[k]	3266
coins	3267
size,	3268
(K	3269
over	3270
top,	3271
ten	3272
col[i]	3273
d[i])	3274
200010	3275
uppercase	3276
arr[s[i]	3277
s=array	3278
a[i]]	3279
bisa	3280
L[i]	3281
ml	3282
strlen(a)	3283
father[x]	3284
a[i].first	3285
v=vector	3286
c4	3287
dp[2]	3288
b[i+1]	3289
xor	3290
size_n	3291
nums[i]	3292
bb)	3293
si	3294
jumlahganjil	3295
dd	3296
ee	3297
F	3298
(((i	3299
b[x]	3300
c=1	3301
msum	3302
dp[i])	3303
oil	3304
sumd	3305
1e10	3306
read(),	3307
__gcd(gcd,	3308
captain	3309
(32	3310
max3	3311
y[i],	3312
lef	3313
maxc	3314
a>b	3315
(abs(a	3316
p[i][0]	3317
Max)	3318
hh,	3319
LCM	3320
'^',	3321
Misha	3322
args	3323
x[n]	3324
a[100005],	3325
towels	3326
4)]	3327
a),	3328
suml	3329
cw	3330
ccw	3331
mk	3332
tempn	3333
(aux	3334
resta	3335
have	3336
min_	3337
(v[j]	3338
smL	3339
rt	3340
(fa	3341
a[1][1]	3342
Cmp	3343
pair<long	3344
(h[i]	3345
max(maxi,	3346
(step	3347
min(t,	3348
cdays	3349
flagA	3350
(ii	3351
(V[i]	3352
Number2	3353
min(y,	3354
(_x	3355
(_y	3356
sizeof(c));	3357
t[0];	3358
'\n');	3359
sum1;	3360
s[0])	3361
(c[0]	3362
cerr	3363
(c[j]	3364
row;	3365
'\n')	3366
p--;	3367
arr;	3368
x1--;	3369
ans.size();	3370
arr[],	3371
"NO");	3372
t.length();	3373
a[k];	3374
s1[i];	3375
(b[i][j]	3376
max(long	3377
b1;	3378
100005;	3379
sizeof(dp));	3380
18)	3381
(x[j]	3382
value;	3383
'n')	3384
(flag1	3385
(s1[i	3386
pt	3387
book[i]	3388
m[2]	3389
asd	3390
v[f]	3391
cycle	3392
r[0]	3393
"5/6"	3394
"1/6"	3395
"1/3",	3396
"1/2",	3397
"2/3",	3398
a[2][0]	3399
x[i][j]	3400
iso	3401
followed	3402
SEGMENT	3403
t[i],	3404
st[0]	3405
-n	3406
ss)	3407
S[1]	3408
1st	3409
abs(y)	3410
90	3411
(r1	3412
1e-8	3413
sag	3414
diag	3415
them	3416
a[j][1]	3417
OUTPUT	3418
LINF	3419
'b'	3420
cups	3421
desk	3422
k-1	3423
"Olya",	3424
"Slava",	3425
chk	3426
j))	3427
dt	3428
Arr[i]	3429
brr[i]	3430
(cnt[i]	3431
INFF	3432
palin	3433
record	3434
s[r]	3435
'Y')	3436
ke	3437
305	3438
decreased	3439
rad	3440
anton	3441
danik	3442
arr[j][1]	3443
take	3444
fg	3445
ud	3446
tims	3447
calc	3448
(ret	3449
122)	3450
a[c]	3451
shifted	3452
1)))	3453
smallest	3454
acc	3455
n1[i]	3456
d1[i	3457
(86400	3458
b[j	3459
mp[v]	3460
n0	3461
fb)	3462
'l',	3463
sss	3464
'7',	3465
maxsum	3466
min_cost	3467
'5'	3468
n=long	3469
mini)	3470
1)]	3471
(abs(i	3472
ck1	3473
(d1	3474
'v',	3475
"undefined"	3476
arr[0][1]	3477
(abs(x	3478
comp2	3479
y),	3480
(c2	3481
m),	3482
"")	3483
ori[i]	3484
j])	3485
f_ans	3486
tol	3487
(a[m]	3488
total_b	3489
2)]	3490
t))	3491
prices	3492
fathercnt[i]	3493
month	3494
ok[j]	3495
Mina	3496
jarak	3497
k])	3498
(v[i	3499
(a[i][0]	3500
str)	3501
t2);	3502
(ok	3503
d1;	3504
(c[1]	3505
sort(s,	3506
start;	3507
v.clear();	3508
m1;	3509
q[i];	3510
x++,	3511
min(int	3512
*a,	3513
y1);	3514
max(int	3515
"Second\n";	3516
ele;	3517
stack<char>	3518
1e5;	3519
360;	3520
x3;	3521
curr;	3522
s.pop();	3523
'2')	3524
pq.pop();	3525
'!')	3526
"Icosahedron")	3527
"UP\n";	3528
"DOWN\n";	3529
31};	3530
incremented	3531
max_i,	3532
1e9+7	3533
4]	3534
5]	3535
(pre	3536
11,	3537
cost1	3538
cost2	3539
board[i][j]	3540
mat	3541
"2/3"	3542
"1/3"	3543
'u',	3544
'Y'	3545
num2,	3546
"5/6",	3547
17	3548
error	3549
fir	3550
":"	3551
(size	3552
cnt[0]	3553
txt	3554
seg	3555
2.0	3556
stones	3557
20000	3558
char(int(a)	3559
x[a]	3560
alt	3561
ust	3562
solution	3563
lj	3564
maxi1	3565
convert	3566
hash	3567
Time	3568
slen	3569
"4	3570
cnt[1]	3571
inclusive)	3572
tank	3573
"Ann",	3574
(M	3575
111	3576
_	3577
default	3578
x,y	3579
bn	3580
word[0]	3581
name,	3582
f[n]	3583
MAX2	3584
y2))	3585
mybak	3586
word[i]	3587
null	3588
y[i	3589
dot	3590
bfs	3591
zsum	3592
ara[i	3593
(number	3594
mina	3595
rem1	3596
minn,	3597
flag)	3598
soma	3599
divisor	3600
s[n]	3601
cont2	3602
ofstream	3603
result[i]	3604
inputs	3605
check()	3606
CHAT	3607
IGNORE	3608
"yellow"	3609
falsy,	3610
"LEFT\n"	3611
"RIGHT\n"	3612
nuts	3613
c[l]	3614
"Tetrahedron"	3615
"Cube"	3616
"Octahedron"	3617
"Dodecahedron"	3618
"O-|O-OOO"	3619
"O-|OO-OO"	3620
"O-|OOOO-"	3621
"-O|-OOOO"	3622
"-O|O-OOO"	3623
"-O|OO-OO"	3624
"-O|OOO-O"	3625
"-O|OOOO-"	3626
price[i]	3627
search	3628
ansf	3629
qClose	3630
spec	3631
vasya	3632
a[110],	3633
arr[j])	3634
ansa	3635
ansb	3636
oven2	3637
oven1	3638
q2	3639
n1)	3640
mod))	3641
numb	3642
ki	3643
swap(u,	3644
face	3645
"A"	3646
andd	3647
g[i	3648
vis[now]	3649
jol	3650
fla	3651
umb	3652
gla	3653
INT_MIN,	3654
1][e]	3655
C)	3656
liter	3657
smR	3658
cha	3659
(ta	3660
(need	3661
5],	3662
c[n	3663
97)	3664
10],	3665
(right	3666
ansm	3667
rem;	3668
u);	3669
(!b)	3670
6);	3671
max1;	3672
k));	3673
a[101][101];	3674
arr[4];	3675
n[i];	3676
(c1[0]	3677
c2[1])	3678
op;	3679
find(int	3680
(udmoves	3681
x--,	3682
a2;	3683
ans[i];	3684
--j)	3685
25;	3686
b[maxn];	3687
(int64_t	3688
v[i]);	3689
(up	3690
a[200005];	3691
1e-8;	3692
'A']++;	3693
st.end())	3694
sz;	3695
result++;	3696
in[i];	3697
ai;	3698
"1\n";	3699
"Howard"};	3700
'e')	3701
"ULDR")	3702
(mxm	3703
min3;	3704
'^')	3705
'v')	3706
ki;	3707
vis,	3708
(vis[i]	3709
12]	3710
'y'	3711
vowel	3712
P1,	3713
P2,	3714
P3,	3715
rprev	3716
six	3717
counter,	3718
a[0][0]	3719
a[2][2]	3720
a[1][0]	3721
midTime	3722
str2,	3723
minIncl	3724
l]	3725
ch[0]	3726
ar[2]	3727
command	3728
charnum	3729
(a[x]	3730
way	3731
was	3732
mi,	3733
0.5	3734
isp	3735
brr	3736
600	3737
cx,	3738
kol,	3739
cm	3740
assigned	3741
50,	3742
pre,	3743
'R',	3744
diag2	3745
hj	3746
mini2	3747
arr[j][i]	3748
INPUT	3749
pref[i]	3750
v[5]	3751
v[4]	3752
medals	3753
bc	3754
blu	3755
mp[s[i]]	3756
plus,	3757
l,r	3758
2e3	3759
1000)	3760
k=1	3761
122	3762
"|"	3763
"Yes\n"	3764
desperate_optimization	3765
(Max	3766
solution"	3767
f[n	3768
aux,	3769
(m[i]	3770
#.	3771
97]	3772
a[j],	3773
a[len	3774
(ct	3775
10001	3776
da	3777
arr[i].second	3778
t0	3779
arr[j][0]	3780
sum_a	3781
lr	3782
count=0	3783
s++)	3784
fo	3785
b[3]	3786
data3	3787
(ch[i]	3788
pet	3789
T[i	3790
s=	3791
this	3792
fi,	3793
(mini	3794
(mod	3795
t[j]	3796
X[i]	3797
st2	3798
(temp2	3799
min(s,	3800
F(t)	3801
mp[x]	3802
pos[i]	3803
exadecimal	3804
cut	3805
(idx	3806
10))	3807
S[i	3808
27)	3809
((ans	3810
getInt(int	3811
prepend	3812
a[i][j])	3813
factor	3814
(et	3815
dp[0][1]	3816
min(m,	3817
dp[x]	3818
s[b]	3819
'K',	3820
assigning	3821
Alice	3822
Bob	3823
A[2]	3824
s[b	3825
"O-|OOO-O"	3826
{"Power",	3827
maxr	3828
area	3829
zhuangtai	3830
ra	3831
c0	3832
m[a[i]]	3833
abs(3	3834
(n2	3835
ansx	3836
may	3837
fail	3838
40	3839
id[i]	3840
ft	3841
p.first	3842
"no"	3843
syl	3844
ish	3845
a0	3846
nowp	3847
min(c,	3848
Solve()	3849
rock	3850
que	3851
beginat	3852
(co	3853
fs	3854
s.erase(s.begin()	3855
int>,	3856
num);	3857
's')	3858
cout.precision(10);	3859
s.clear();	3860
ans1++;	3861
ans2++;	3862
(input[i]	3863
len);	3864
sort(x,	3865
bb;	3866
c(int	3867
(g[i])	3868
(!a[i])	3869
(i1	3870
(A[i][j]	3871
isprime(long	3872
ys)	3873
x1);	3874
maxi;	3875
flag2;	3876
length;	3877
sum2++;	3878
a[100001];	3879
answer++;	3880
90)	3881
"-";	3882
char>	3883
&x)	3884
div;	3885
a[1]);	3886
index;	3887
B[i];	3888
u++)	3889
arr2[i];	3890
V[i];	3891
'V')	3892
"DL")	3893
'b')	3894
"purple")	3895
"green")	3896
"blue")	3897
"orange")	3898
"red")	3899
"O-|";	3900
h--;	3901
rep;	3902
"halfplus")	3903
sizeof(vis)	3904
(((n	3905
edges	3906
visited	3907
1000000007LL	3908
'i',	3909
200,	3910
p[2]	3911
"B"	3912
min(l	3913
a[1][2]	3914
times,	3915
line,	3916
palindrome	3917
previous	3918
i][2	3919
table[i][j]	3920
byte	3921
t[k]	3922
getline	3923
c[i][j	3924
cn1	3925
arr[0],	3926
q[a]	3927
1][0])	3928
ji	3929
m],	3930
x[k]	3931
v[j	3932
prime[0]	3933
q[0]	3934
ar[j	3935
55,	3936
l1)	3937
ry	3938
pm	3939
down,	3940
r2)	3941
s[cnt]	3942
lx	3943
sl	3944
52	3945
mini1	3946
"0\n"	3947
jmax	3948
denominator	3949
right,	3950
"|#.#.#.#.#.#.#.#.#.#.#.|.|"	3951
maxcount	3952
yellow	3953
foo	3954
ans[1]	3955
asc	3956
ar[j]	3957
inner	3958
s[size	3959
min(r,	3960
x0,	3961
bak	3962
R[i]	3963
numbers	3964
d]	3965
arr[n-1]	3966
max(r,	3967
pe	3968
100100	3969
"captain"	3970
gcd(x,	3971
a,b,c,d	3972
min(sum,	3973
p[3]	3974
1000006	3975
data1	3976
f=0	3977
s[p[i]]	3978
elements,	3979
gotoup	3980
A[i],	3981
s[x	3982
vv[i]	3983
"O"	3984
(temp1	3985
mi)	3986
j=i+1	3987
(pow	3988
5e5	3989
till	3990
n-k	3991
ba	3992
(f2	3993
satu	3994
c[j	3995
"|O.#.#.#.#.#.#.#.#.#.#.|D|)"	3996
"|O.#.#.#.#.#.#.#.#.#.#.|.|"	3997
indx	3998
array[i]	3999
po	4000
mm,	4001
x=int	4002
a[105]	4003
n=0	4004
a[n])	4005
"impossible"	4006
HIM!	4007
Pic[i	4008
a[i]),	4009
a[i][abs(j	4010
a[abs(i	4011
non	4012
(mm	4013
(time	4014
Tie	4015
Num	4016
iterations	4017
arr[0][0]	4018
mp[x][y	4019
ops	4020
noop	4021
crew	4022
abs(f1	4023
cntfloat	4024
min(a[i],	4025
']'	4026
(ss	4027
n4	4028
games	4029
w2,	4030
x.size()	4031
cal[i][j]	4032
nas	4033
second)	4034
s.end()),	4035
a[1005],	4036
sum_b	4037
a[v1	4038
light[i	4039
Qr	4040
MAXT	4041
ara2[i]	4042
siz	4043
rl2	4044
a],	4045
m[a[i][j	4046
maxlen	4047
cmax	4048
bitwise-xor	4049
(vec[i]	4050
(a[k]	4051
a[1][1])	4052
te	4053
B[i	4054
band	4055
arr[n],	4056
gh	4057
dx[4]	4058
dy[4]	4059
a.size(),	4060
Number1,	4061
ant2,	4062
se;	4063
ok;	4064
max_j;	4065
++j;	4066
cost;	4067
p[0];	4068
T2;	4069
m[i];	4070
f(long	4071
next;	4072
V;	4073
arr[3];	4074
string::npos)	4075
96;	4076
way[tstep++]	4077
arr[j];	4078
g[1000005];	4079
(c(i))	4080
(!c(i))	4081
ls;	4082
false);	4083
b[N];	4084
sort(p,	4085
prime(int	4086
i--,	4087
dy)	4088
yf)	4089
kol++,	4090
(dx	4091
(xt	4092
fy)	4093
an[++ans]	4094
'\0')	4095
myset;	4096
D;	4097
m++)	4098
s[101];	4099
(int)s.size();	4100
24;	4101
"First\n";	4102
s2.length();	4103
arr[100005];	4104
s.erase(unique(s.begin(),	4105
pq;	4106
pq.top();	4107
cur++;	4108
a.push_back(x);	4109
acos(0.0);	4110
1e10;	4111
'3')	4112
day;	4113
total++;	4114
u1;	4115
u2;	4116
"yellow")	4117
"4";	4118
MAX;	4119
"-O|";	4120
N);	4121
1000000009LL	4122
n-2	4123
m[3]	4124
DFS	4125
capital	4126
(6	4127
x]	4128
str3	4129
str2[1]	4130
cond	4131
(1ll	4132
mt	4133
gc	4134
pro	4135
person	4136
table	4137
cmd	4138
perColor	4139
M[i][j]	4140
b=0	4141
it's	4142
ss[0]	4143
t--	4144
isprime[i]	4145
prime[1]	4146
d_x	4147
sum[0]	4148
priority	4149
bao2	4150
d[2]	4151
d[3]	4152
comparison	4153
li,	4154
arr[i+1]	4155
jmin	4156
'A']	4157
23	4158
d[x]	4159
bl,	4160
test,	4161
getInt	4162
n=int,	4163
"***"	4164
x1,y1,x2,y2	4165
cntb	4166
cnta	4167
"a"	4168
"No\n"	4169
'{'	4170
b3)	4171
tab	4172
tc,	4173
25,	4174
v[m	4175
dp[n-1]	4176
128,	4177
O.	4178
poww	4179
di	4180
min2,	4181
(mn	4182
a[t	4183
b=array	4184
end)	4185
fim	4186
xa	4187
m[a]	4188
tot,	4189
t=int	4190
32)	4191
encrypt	4192
mas	4193
f[x]	4194
b[t]	4195
r]	4196
seq	4197
s[l	4198
sort(A,	4199
newsum	4200
(l1	4201
gotodown	4202
An	4203
(days	4204
line[i]	4205
column	4206
dp[0][i]	4207
grid	4208
work	4209
node	4210
v3	4211
'n'	4212
height	4213
y[3]	4214
P,	4215
dua	4216
48,	4217
maxnum	4218
(cek	4219
countb	4220
max(0LL,	4221
((1	4222
'2'	4223
dem)	4224
dimension	4225
drink	4226
b[105],	4227
round1	4228
cell[i][j]	4229
"green"	4230
"blue"	4231
"orange"	4232
d[p]	4233
cast	4234
r3	4235
a[k][j]	4236
boxes	4237
(k[i]	4238
A[i])	4239
n[i][j]	4240
ara[0]	4241
"7"	4242
names	4243
"Icosahedron"	4244
2*n	4245
n[i	4246
((int)a[i]	4247
maks	4248
ostream	4249
f2)	4250
neo	4251
max2)	4252
end;	4253
A[n	4254
name[j]	4255
locg	4256
loct	4257
foot	4258
black[x	4259
choc	4260
shengyu	4261
previousContest	4262
fff	4263
A[pair<long	4264
(v1	4265
(rest	4266
_c	4267
t01	4268
m2)	4269
differ	4270
items[i]	4271
max_num	4272
losp	4273
Input()	4274
mnd	4275
a[6],	4276
dos_a_la[i]	4277
blanco	4278
ope[i]	4279
h1)	4280
y[1][1]	4281
(v[n	4282
min(ans1,	4283
min(mi,	4284
c[j])	4285
t[1];	4286
memset(s,	4287
f++)	4288
1e-7;	4289
sieve()	4290
(mark	4291
pair<string,	4292
(;;)	4293
o++;	4294
-n;	4295
"RD";	4296
"LD";	4297
"RU";	4298
"LU";	4299
*it;	4300
mn);	4301
judge(int	4302
max(d,	4303
b.length();	4304
55;	4305
(str[i][j]	4306
a[10000];	4307
gets(a);	4308
cnt2;	4309
100);	4310
'}')	4311
dist[i];	4312
a[1001];	4313
ans1;	4314
check(long	4315
b[100];	4316
max(sum,	4317
size_n;	4318
a[MAXN];	4319
200005;	4320
puts("-1");	4321
n];	4322
(!ok)	4323
(a[l]	4324
v1[i];	4325
5001;	4326
(dem	4327
"qwertyuiopasdfghjkl;zxcvbnm,./";	4328
pq.push(x);	4329
n.length();	4330
ans2;	4331
8);	4332
a[n][n];	4333
(pos1	4334
max(s,	4335
12);	4336
'>')	4337
ne	4338
v[a]	4339
min_i,	4340
"8"	4341
b[j],	4342
tp3	4343
r0	4344
Y,	4345
b[i][0]	4346
prealoc	4347
else,	4348
n[2]	4349
dp[i][j][k]	4350
number,	4351
clock()	4352
vs	4353
ch1,	4354
it->first	4355
send_size	4356
s=0	4357
")	4358
n[j]	4359
(arr[1]	4360
last,	4361
p[a]	4362
par	4363
charsum	4364
indefinitely	4365
ccnt	4366
csx	4367
d2,	4368
cnt]	4369
d_y	4370
a[temp]	4371
ii,	4372
*it	4373
ch3	4374
ey	4375
i-1	4376
p[i])	4377
va	4378
inicial	4379
n,d	4380
debug	4381
s[length	4382
greatest	4383
t=0	4384
a[i+1],	4385
gr,	4386
n=1	4387
R"	4388
contain	4389
12,	4390
raw[up	4391
set<int>::iterator	4392
s[len	4393
Max,	4394
ans=1	4395
'|'	4396
"X++"	4397
b.size()	4398
100002	4399
y=0	4400
s[p]	4401
possible	4402
memset(r,	4403
mint	4404
num[x]	4405
(ck	4406
temp[i]	4407
infint64_t	4408
b[5]	4409
b[4]	4410
a[increment	4411
minb	4412
x))	4413
k),	4414
cc)	4415
sumi	4416
ganjilterkecil	4417
b[m]	4418
x2),	4419
letters	4420
step1	4421
rides	4422
cnt4	4423
(xx	4424
stone	4425
res=0	4426
__gcd(x,	4427
s[c]	4428
ci	4429
first)	4430
((w	4431
Equal	4432
lc	4433
(hi	4434
getchar(),	4435
TIE	4436
"purple"	4437
"red"	4438
freopen	4439
v.end())	4440
team	4441
ce	4442
max(((3	4443
a[1001],	4444
a[10],	4445
pow(x,	4446
psum	4447
cntint	4448
"DL"	4449
"DR"	4450
{100,	4451
t[5]	4452
ttoalha	4453
max(a[i],	4454
ho	4455
lf	4456
47	4457
bst	4458
numStar	4459
iskom	4460
v[v.size()	4461
r[i])	4462
<<=	4463
but	4464
(aa	4465
"yes"	4466
find(q)	4467
find(p)	4468
5))	4469
mn1	4470
row_start	4471
previousGym	4472
ar[n	4473
Ql	4474
long>(u,	4475
mc	4476
second[pos]	4477
ope	4478
arr[1][1]	4479
p2[k]	4480
mat[i	4481
minn2	4482
m[v]	4483
a[1][2])	4484
a[2][1])	4485
((arr[i]	4486
minp	4487
(a[x][y]	4488
(t[i	4489
nike	4490
losn	4491
nadj	4492
query(ajout	4493
a.size()],	4494
b.size()],	4495
totalday	4496
stat	4497
wheniEndFromLeft	4498
faces	4499
bsum	4500
(ans)	4501
1LL;	4502
s2[i];	4503
++it)	4504
c[j];	4505
tolower(s[i]);	4506
t1);	4507
max(y,	4508
st.size();	4509
'X')	4510
gcd;	4511
'p')	4512
Q;	4513
it->second;	4514
(t[0]	4515
s[110];	4516
co++;	4517
num--;	4518
sort(ar,	4519
arr[100];	4520
ar[n];	4521
cnt1--;	4522
y1--;	4523
to;	4524
s[1005];	4525
len++;	4526
abs(a);	4527
max(maxn,	4528
(startx	4529
endy)	4530
(i2	4531
u++;	4532
min(mini,	4533
itr;	4534
a[100000],	4535
j];	4536
k--)	4537
(score	4538
(m);	4539
(!found)	4540
'a');	4541
cout.setf(ios::fixed);	4542
"***";	4543
y3;	4544
1e9)	4545
a[2]);	4546
pos++;	4547
sort(arr	4548
'|';	4549
v[0];	4550
(a[p]	4551
Input();	4552
10000000;	4553
-1);	4554
putchar('\n');	4555
ma)	4556
h++)	4557
var;	4558
w++;	4559
1][2]);	4560
(abs(n	4561
fb);	4562
"7";	4563
mp[s];	4564
(q[i]	4565
_n;	4566
1LL,	4567
fastIo	4568
min_j,	4569
G,	4570
*ans	4571
vis[i][j]	4572
itself	4573
(0),	4574
15,	4575
countr	4576
chance	4577
1e-7	4578
sleepTime	4579
maxExcl	4580
spf[j]	4581
longs,	4582
prevr	4583
'r',	4584
SIZE	4585
terminate	4586
arr[3])	4587
last_stripe	4588
ev	4589
od	4590
32,	4591
'.',	4592
hn	4593
goal	4594
sign_X	4595
length,	4596
abs(s[1]	4597
MAXN,	4598
bao1	4599
chodoi	4600
dx,	4601
xd	4602
yd	4603
a[u]	4604
a[s]	4605
fy	4606
minj	4607
maxj	4608
char,	4609
(abs(a[i]	4610
row_max	4611
100000,	4612
start_x	4613
start_y	4614
end_x	4615
end_y	4616
x,y=int	4617
50)	4618
seed	4619
he	4620
is_square	4621
yelo	4622
now)	4623
(0)	4624
answers	4625
el	4626
leave	4627
100007	4628
'c'	4629
exclusive),	4630
"left"	4631
floats	4632
y0,	4633
0.0	4634
s.length())	4635
th	4636
26,	4637
v[k	4638
r[i][j]	4639
delete	4640
str_dif	4641
a=0	4642
vi	4643
2147483647	4644
D)	4645
100005,	4646
210	4647
Yellow	4648
buffer	4649
gl,	4650
works	4651
exp,	4652
boolean,	4653
digit,	4654
hotels	4655
e);	4656
(maxn	4657
j+1	4658
4))	4659
shelves	4660
'g')	4661
1100	4662
'='	4663
any	4664
Res	4665
format	4666
(fi	4667
Pi	4668
a+1	4669
(ind	4670
ptr	4671
page	4672
v2[i]	4673
a[num]	4674
tot)	4675
buf	4676
tmpa	4677
dat[i]	4678
1007	4679
timer	4680
arr[4]	4681
second_layer	4682
ay,	4683
bx,	4684
by,	4685
slice	4686
lo)	4687
Howard	4688
b[1][1]	4689
max2,	4690
iterating	4691
bal[i]	4692
angle	4693
HER!	4694
mi2	4695
Still	4696
Rozdil	4697
arr[5]	4698
cnt[i	4699
MAXM	4700
1].first	4701
s[a	4702
s.size(),	4703
"green",	4704
"blue",	4705
"orange",	4706
"red",	4707
lie	4708
num_p	4709
borrow	4710
forward	4711
"sylveon"	4712
raised	4713
(mp[x	4714
a[i][j],	4715
a=1	4716
gap)	4717
kmax	4718
jwb	4719
factorial	4720
w[i	4721
o),	4722
x4	4723
deq	4724
numa	4725
a[i].first.second	4726
second_points	4727
